**** 2.2.3. 测试僵尸进程
#+BEGIN_SRC C
#include <stdio.h>
#include <signal.h>
#include <sys/wait.h>
int main( void )
{
	pid_t	pid;
	if ( ( pid = fork() ) == 0 ){
		printf("child:%d\n", getpid());
		exit(0);
	}
	sleep( 20 );
	if ( pid > 0 ){
		printf("parent:%d\n", getpid() );
	}

	return 0;
}
#+END_SRC

#+RESULTS:
| child:19930  |
| parent:19929 |

在显示child:14447而尚未显示parent:14446(即20秒的睡眠时间)，执行如下命令：
#+BEGIN_SRC bash
ps -eo state,pid,cmd | grep '^Z'
#+END_SRC
发现子进程14447为僵尸进程。但是过了20秒后，再次执行时候，则没有任何数据，说明僵尸进程已经被父进程
杀死了（就是父进程读取了子进程的数据）

